---
kind: type
id: T:Autodesk.Revit.DB.SlabShapeCreaseArray
source: html/dbb7004c-920c-74ce-bde2-834d46b0c132.htm
---
# Autodesk.Revit.DB.SlabShapeCreaseArray

An array that can contain any number of creases used in Slab Shape Editing.

## Syntax (C#)
```csharp
public class SlabShapeCreaseArray : APIObject,
	IEnumerable
```